


#ifndef _APP_GNSS_H_
#define _APP_GNSS_H_





//U10-H82
// uint8_t gps_gpgga[] = "$GNGGA,021525.000,3958.48068,N,11619.76500,E,1,03,3.59,58.4,M,-8.4,M,,*58";
// uint8_t gps_gprmc[] = "$GNRMC,021525.000,A,3958.48068,N,11619.76500,E,50.55,100.8,170117,,,A*73";

//U26-37
// uint8_t gps_gpgga[] = "$GPGGA,065530.000,3958.4720,N,11619.7861,E,1,5,1.62,97.8,M,-6.5,M,,*71";
// uint8_t gps_gprmc[] = "$GPRMC,065530.000,A,3958.4720,N,11619.7861,E,0.09,321.30,260917,,,A*6A";

/*----------------------------------$GPRMCµÄÊı¾İ¸ñÊ½---------------------------------
    |  $GPRMC,(1),(2),(3),(4),(5),(6),(7),(8),(9),(10),(11),(12)*hh(CR)(LF)
    |  $GNRMC,072614.000,A,4002.31484,N,11614.48248,E,0.318,7.08,210816,,,A*42
    |  <1> UTCÊ±¼ä£¬hhmmss£¨Ê±·ÖÃë£©¸ñÊ½    ·¶Î§:000000-235959
    |  <2> ¶¨Î»×´Ì¬£¬A=ÓĞĞ§¶¨Î»£¬V=ÎŞĞ§¶¨Î»
    |  <3> Î³¶Èddmm.mmmm£¨¶È·Ö£©¸ñÊ½£¨Ç°ÃæµÄ0Ò²½«±»´«Êä£© ·¶Î§:0¡ã-90¡ã
    |  <4> Î³¶È°ëÇòN£¨±±°ëÇò£©»òS£¨ÄÏ°ëÇò£©
    |  <5> ¾­¶Èdddmm.mmmm£¨¶È·Ö£©¸ñÊ½£¨Ç°ÃæµÄ0Ò²½«±»´«Êä£©·¶Î§:-180¡ã-180¡ã
    |  <6> ¾­¶È°ëÇòE£¨¶«¾­£©»òW£¨Î÷¾­£©
    |  <7> µØÃæËÙÂÊ£¨000.0~999.9½Ú£¬Ç°ÃæµÄ0Ò²½«±»´«Êä£©   µ¥Î»:º£Àï/Ğ¡Ê±
    |  <8> µØÃæº½Ïò£¨000.0~359.9¶È£¬ÒÔÕæ±±Îª²Î¿¼»ù×¼£¬Ç°ÃæµÄ0Ò²½«±»´«Êä£©·¶Î§:000.0-359.9
    |  <9> UTCÈÕÆÚ£¬ddmmyy£¨ÈÕÔÂÄê£©¸ñÊ½    ·¶Î§:060180 -xxxxxx
    |  <10> ´ÅÆ«½Ç£¨000.0~180.0¶È£¬Ç°ÃæµÄ0Ò²½«±»´«Êä£©
    |  <11> ´ÅÆ«½Ç·½Ïò£¬E£¨¶«£©»òW£¨Î÷£©
    |  <12> Ä£Ê½Ö¸Ê¾£¨½öNMEA0183 3.00°æ±¾Êä³ö£¬A=×ÔÖ÷¶¨Î»£¬D=²î·Ö£¬E=¹ÀËã£¬N=Êı¾İÎŞĞ§£©
    --------------------------------------------------------------------------------*/
/*----------------------------------$GPGGAµÄÊı¾İ¸ñÊ½----------------------------------
    |  $GPGGA,(1),(2),(3),(4),(5),(6),(7),(8),(9),M,(10),M,(11),(12)*hh(CR)(LF)
    |  $GNGGA,032829.000,3958.47774,N,11619.78307,E,1,10,1.86,74.7,M,-8.4,M,,*5E
    |  <1> UTC Ê±¼ä£¬¸ñÊ½Îª hhmmss.ss£»
    |  <2> Î³¶È£¬¸ñÊ½Îª ddmm.mmmmm£¨¶È·Ö¸ñÊ½£© £»
    |  <3> Î³¶È°ëÇò£¬N »òS£¨±±Î³»òÄÏÎ³£©£»
    |  <4> ¾­¶È£¬¸ñÊ½Îª dddmm.mmmmm£¨¶È·Ö¸ñÊ½£© £»
    |  <5> ¾­¶È°ëÇò£¬E »òW£¨¶«¾­»òÎ÷¾­£©£»
    |  <6> GPS×´Ì¬£¬0=Î´¶¨Î»£¬1=·Ç²î·Ö¶¨Î»£¬2=²î·Ö¶¨Î»£»
    |  <7> ÕıÔÚÊ¹ÓÃµÄÓÃÓÚ¶¨Î»µÄÎÀĞÇÊıÁ¿£¨00~12£©
    |  <8> HDOP Ë®Æ½¾«È·¶ÈÒò×Ó£¨0.5~99.9£©
    |  <9> º£°Î¸ß¶È£¨-9999.9µ½9999.9Ã×£©
    |  <10> ´óµØË®×¼Ãæ¸ß¶È£¨-9999.9µ½ 9999.9Ã×£©
    |  <11> ²î·ÖÊ±¼ä£¨´Ó×î½üÒ»´Î½ÓÊÕµ½²î·ÖĞÅºÅ¿ªÊ¼µÄÃëÊı£¬·Ç²î·Ö¶¨Î»£¬´ËÏîÎª¿Õ£©
    |  <12> ²î·Ö²Î¿¼»ùÕ¾±êºÅ£¨0000µ½1023£¬Ê×Î» 0Ò²½«´«ËÍ£¬·Ç²î·Ö¶¨Î»£¬´ËÏîÎª¿Õ)
    --------------------------------------------------------------------------------*/
/*----------------------------------$GPGSAµÄÊı¾İ¸ñÊ½----------------------------------
    |  $GPGSA,(1),(2),(3),,,,,(3),(3),(3),(4),(5),(6),(7)(CR)(LF)
    |  $GNGGA,032829.000,3958.47774,N,11619.78307,E,1,10,1.86,74.7,M,-8.4,M,,*5E
    |  <1> Ä£Ê½ £ºM = ÊÖ¶¯£¬ A = ×Ô¶¯£»
    |  <2> ¶¨Î»ĞÍÊ½ 1 = Î´¶¨Î»£¬2 = ¶şÎ¬¶¨Î»£¬3 = ÈıÎ¬¶¨Î»£»
    |  <3> PRN Êı×Ö£º01 ÖÁ 32 ±íÌì¿ÕÊ¹ÓÃÖĞµÄÎÀĞÇ±àºÅ£¬×î¶à¿É½ÓÊÕ12¿ÅÎÀĞÇĞÅÏ¢
    |  <4> PDOPÎ»ÖÃ¾«¶ÈÒò×Ó£¨0.5~99.9£©
    |  <5> HDOPË®Æ½¾«¶ÈÒò×Ó£¨0.5~99.9£©
    |  <6> VDOP´¹Ö±¾«¶ÈÒò×Ó£¨0.5~99.9£©
    |  <7> Checksum.(¼ì²éÎ»)
    --------------------------------------------------------------------------------*/
/*----------------------------------$GPGSVµÄÊı¾İ¸ñÊ½----------------------------------
    |  $GPGSV,(1),(2),(3),(4),(5),(6),(7),(8),(9),(10),(11),(12),(13),(14)(CR)(LF)
    |  $GPGSV£¬4,1,13,02,02,213£¬03£¬-3000£¬11,00,121£¬14,13,172,05 * 67
    |  <1> GSVÓï¾äµÄ×ÜÊı £»
    |  <2> ±¾¾äGSVµÄ±àºÅ£»
    |  <3> ¿É¼ûÎÀĞÇµÄ×ÜÊı£¬00 ÖÁ 12
    |  <4> ÎÀĞÇ±àºÅ£¬ 01 ÖÁ 32
    |  <5> ÎÀĞÇÑö½Ç£¬ 00 ÖÁ 90 ¶È
    |  <6> ÎÀĞÇ·½Î»½Ç£¬ 000 ÖÁ 359 ¶È¡£Êµ¼ÊÖµ
    |  <7> Ñ¶ºÅÔëÉù±È£¨C/No£©£¬ 00 ÖÁ 99 dB£»ÎŞ±íÎ´½ÓÊÕµ½Ñ¶ºÅ
    |  <8> ~ <11> ÓĞ¹ØµÚ¶ş¸öSVµÄĞÅÏ¢£¬¸ñÊ½Óë×Ö¶Î4µ½7ÏàÍ¬
    |  <12> ~ <15> ÓĞ¹ØµÚÈı¸öSVµÄĞÅÏ¢£¬¸ñÊ½Óë×Ö¶Î4µ½7ÏàÍ¬
    |  <16> ~ <19> ÓĞ¹ØµÚËÄ¸öSVµÄĞÅÏ¢£¬¸ñÊ½Óë×Ö¶Î4µ½7ÏàÍ¬
    |  <20> Ğ£ÑéºÍÊı¾İÊ¼ÖÕÒÔ*¿ªÍ·
    --------------------------------------------------------------------------------*/



#include <rtthread.h>
#include <rtdevice.h>


#include "board.h"
#include "app_packet.h"


#define GPS_BUFF_SIZE (UART1_BUFF_SIZE)


#pragma pack(1)

struct gnss_str
{
	struct rt_semaphore 				gnss_sign;					//½ÓÊÕµ½ĞÅºÅ
  uint32_t 										ticks;							//¼ÆÊıÆ÷
  uint16_t 										data_len;						//½ÓÊÕµ½µÄÊı¾İ³¤¶È
  uint16_t 										cnt_reset; 					//¶¨Î»Ê§°ÜÖØÆôµÄÊ±¼ä
	uint32_t 										nmea_cnt;						//½ÓÊÕµ½NmeaÊı¾İ°ü×Ô¶¯¼ÓÒ»
	uint32_t 										real_longitude;   	//¾­¶È  µ±Ç°¾­¶È
  uint32_t 										real_latitude;     //Î³¶È  µ±Ç°Î¬¶È
	
	uint32_t										prev_longitude;			//ÉÏÒ»¸ö¶¨Î»µã
	uint32_t 										prev_latitude;      //ÉÏÒ»¸ö¶¨Î»µã
	
	uint8_t											state;              //
	uint8_t											step;               //
	uint8_t											erro_cnt;           //´íÎó¼ÆÊıÆ÷
	
	uint8_t											state_back;         //¶¨Î»×´Ì¬±¸·İ
	
	uint8_t 										debug_state;     //Æô¶¯×´Ì¬
};


/***********************************************

***********************************************/

struct gnss_info_str
{	
    uint8_t 					state;        			//ÊÇ·ñ¶¨Î» 0:Î´¶¨Î»
    uint8_t 					longitude_ew; 			//¶«Î÷¾­ 0:¶« 1:Î÷
    uint8_t 					latitude_sn;  			//ÄÏ±±Î³ 0:±± 1:ÄÏ
    uint32_t 					longitude_normal;   				//¾­¶È xxxyyyyyy = xxx.yyyyyy(¶È)*1000000
    uint32_t 					latitude_normal;    				//Î³¶È  ¶È
    uint32_t 					altitude;    				//º£°Î Ã×  
    uint16_t 					heading;     				//º½Ïò ¶È
    uint16_t 					speed;       				//ËÙ¶È ¹«Àï/Ğ¡Ê±  ±£ÁôÒ»Î»ÓĞĞ§Ğ¡Êı À©´ó10±¶  
    uint8_t 					satellite_num; 			//Ê¹ÓÃÎÀĞÇ¸öÊı
    uint16_t 					hdop;        				//Ë®Æ½¾«¶ÈÒò×Ó
		uint32_t 					nmea_cnt;  					//½ÓÊÕµ½nmeaĞÅÏ¢
		uint8_t 	 				gps_sate_num;				//GPS¿ÉÊÓÎÀĞÇÊıÁ¿
		uint8_t 					bd_sate_num;				//±±¶·¿ÉÊÓÎÀĞÇÊıÁ¿
		struct rt_tm			utc_time;						//ÊÀ½çÊ±¼ä£¨Î´¼ÓÊ±Çø£©
		struct rt_tm 			btc_time;						//±±¾©Ê±¼ä
		uint32_t	 				timestamp;          //±±¾©Ê±¼äÊ±¼ä´Á£¨1970.1.1 0.0.0£©
		uint8_t						rtc_set_state;			//Éè±¸ÊÚÊ±±êÖ¾
		uint8_t  					module_state; 			//GNSSÄ£¿é×´Ì¬
		uint8_t						ant_state;					//
		/**
		¶¨Î»Ä£¿é×´Ì¬£ºÄ¬ÈÏ0£ºÕı³£
											1£º
											2£º
											3£º
		**/
		uint32_t 					longitude_nmea;        //
		uint32_t					latitude_nmea;         //åº¦.åˆ†.åˆ† 
};
#pragma pack()




uint8_t read_gnss_positing_state(void);					//
uint32_t read_gnss_nmea_cnt(void);							//
uint8_t read_gnss_satellite_num(void);					//
uint16_t read_gnss_altitude(void);							// 
uint16_t read_gnss_heading(void);     					// 
uint8_t	read_gnss_gps_sate_num(void);						// 
uint8_t  read_gnss_bd_sate_num(void);						// 
uint16_t read_gnss_hdop(void);      						//
uint32_t read_gnss_longitude(uint8_t n);				//
uint32_t read_gnss_latitude(uint8_t n);					//
uint16_t read_gnss_speed(void);									//
void read_gnss_utc_time(struct rt_tm *ptime);		//
uint8_t read_gnss_longitude_ew(void);						//
uint8_t read_gnss_latitude_sn(void);						//
uint32_t read_gnss_btc_timetamp(void);					//
void close_gnss_module(void);										//
uint8_t read_gnss_module_state(void);						//
uint8_t	read_gnss_info(struct gnss_info_str *source);
void thread_entry_gnss(void *parameter);
uint8_t init_gnss_debug_state(uint8_t n);


#endif


